[{"Page Header":"Electronics/IT Support","Page Text":"    Support for personal computers and mobile devices has evolved into one of the largest service industries in the world. This program is designed to prepare students to help maintain, support, and upgrade PC’s and mobile devices.\r\n      In order to be a marketable computer support technician, you need to learn how the components of a computer work with the operating system software so you can apply that knowledge in troubleshooting a faulty computer system.\r\n    Acquire the knowledge and hands-on skills to become an IT technician. Perform repairs and upgrades to hardware, software, and other IT related devices.\r\n Learn more about electronics and how circuits make IT equipment function. Maintain and troubleshoot computers so they operate effectively and are virus free.","Page Video":"/videos/mr_saia.mp4","Endpoint":"/Hardware"},{"Page Header":"Information Systems Management","Page Text":"    This program of study focuses on the implementation and maintenance of both desktop and server operating systems.\r\n    The Goal of this program is to train students to act as system administrators.  To accomplish this students begin with Introduction\r\n    to software 1 and 2 which covers the installation and administration of the windows OS. The Junior and Senior year of IT Systems will\r\n     cover server operating systems and Linux desktop and server operations.  Systems admin topics such as cyber security and networking are covered but not emphasized.  ","Page Video":"/videos/mr_saia.mp4","Endpoint":"/Software"},{"Page Header":"Networking and Cyber Security","Page Text":"        Students enrolled in the Network Engineering Technology program will study official CISCO\r\n        curricula covering the CISCO Routing Internet Operating System.  Students will pursue their certification\r\n        as a CISCO Certified Network Associate (CCNA). Network engineering covers subjects such as designing,\r\n        installing, and configuring world-wide computer networks, computer network wiring, network security,\r\n        network management, network connections to the internet, network protocols, web page hosting, installing\r\n        and configuring Desktop Operating Systems and installation and distribution of software applications across the network.\r\n        Students can also cross train between Computer Network Engineering Technology and Computer Technology to pursue a Microsoft Certified Product Specialist\r\n         in various Microsoft Network and Desktop Operating Systems and software applications.","Endpoint":"/Networking"},{"Page Header":"Computer Programming","Page Text":"        Computer Programming students are given an opportunity to explore the Oracle Academy \r\n        curriculum, as well as a host of other programming languages.  In the Oracle Academy, students\r\n        will begin with a study of data modeling and data analysis, followed by SQL (Structured Query Language)\r\n        in preparation for an Oracle entry-level certification.  The Oracle Academy allows students to control\r\n         the internet by creating interactive web page designs that access a database for data handling and manipulation.\r\n        Students have the opportunity to enter international competitions through the Oracle Academy.\r\n        Students will gain competencies in computer programming languages, intense database analysis and design, advanced web page development, and computer-based presentations.","Page Video":"/videos/mr_saia.mp4","Endpoint":"/Programming"}]