[{"Page Header":"Electronics/IT Support","Page Text":"    Support for personal computers and mobile devices has evolved into one of the largest service industries in the world. This program is designed to prepare students to help maintain, support, and upgrade PC’s and mobile devices.\r\n      In order to be a marketable computer support technician, you need to learn how the components of a computer work with the operating system software so you can apply that knowledge in troubleshooting a faulty computer system.\r\n    Acquire the knowledge and hands-on skills to become an IT technician. Perform repairs and upgrades to hardware, software, and other IT related devices.\r\n Learn more about electronics and how circuits make IT equipment function. Maintain and troubleshoot computers so they operate effectively and are virus free.","Page Video":"/videos/saiareact.mp4","Endpoint":"/Hardware"},{"Page Header":"Information Systems Management","Page Text":"    This program of study focuses on the implementation and maintenance of both desktop and server operating systems.\r\n    The Goal of this program is to train students to act as system administrators.  To accomplish this students begin with Introduction\r\n    to software 1 and 2 which covers the installation and administration of the windows OS. The Junior and Senior year of IT Systems will\r\n     cover server operating systems and Linux desktop and server operations.  Systems admin topics such as cyber security and networking are covered but not emphasized.  ","Page Video":"/videos/saiareact.mp4","Endpoint":"/Software"},{"Page Header":"Networking and Cyber Security","Page Text":"        Students enrolled in the Network Engineering Technology program will study official CISCO\r\n        curricula covering the CISCO Routing Internet Operating System.  Students will pursue their certification\r\n        as a CISCO Certified Network Associate (CCNA). Network engineering covers subjects such as designing,\r\n        installing, and configuring world-wide computer networks, computer network wiring, network security,\r\n        network management, network connections to the internet, network protocols, web page hosting, installing\r\n        and configuring Desktop Operating Systems and installation and distribution of software applications across the network.\r\n        Students can also cross train between Computer Network Engineering Technology and Computer Technology to pursue a Microsoft Certified Product Specialist\r\n         in various Microsoft Network and Desktop Operating Systems and software applications.","Endpoint":"/Networking"},{"Page Header":"Computer Programming","Page Text":"        Computer Programming students are given an opportunity to explore the Oracle Academy \r\n        curriculum, as well as a host of other programming languages.  In the Oracle Academy, students\r\n        will begin with a study of data modeling and data analysis, followed by SQL (Structured Query Language)\r\n        in preparation for an Oracle entry-level certification.  The Oracle Academy allows students to control\r\n         the internet by creating interactive web page designs that access a database for data handling and manipulation.\r\n        Students have the opportunity to enter international competitions through the Oracle Academy.\r\n        Students will gain competencies in computer programming languages, intense database analysis and design, advanced web page development, and computer-based presentations.","Page Video":"/videos/saiareact.mp4","Endpoint":"/Programming"},{"Page Header":"Culinary Arts","Page Text":"Chop, fillet and create exciting cuisine every day as you experience the fast paced culinary industry.  From cooking for the student run Spartan Inn to providing food for large groups, students gain valuable restaurant experience.  Bake breads, cakes, pies, experiment with confections and chocolate.","Endpoint":"/Culinary"},{"Page Header":"Architecture & Construction Technology","Page Text":"\r\nThe Architecture and Construction Technology program prepares individuals to apply technical knowledge and skills to the basic aspects of planning, preparing and interpreting architectural, structural, electrical, topographical and other drawings and sketches used in various Architectural and Construction fields.\r\n\r\nInstruction is designed to provide experiences in AutoCAD and Revit design software for production of Architectural drawings. Instruction will be provided in pro-estimating and fastrack software for estimating and scheduling.\r\n\r\nIn addition to digital modeling we will also be creating physical models to understand special relationships. Students will have the opportunity to be dual enrolled their Junior and Senior year where they will obtain 18 credits with H.A.C.C. towards their Architecture or Construction Management degrees.","Endpoint":"/Architecture"},{"Page Header":"Automotive Technology ","Page Text":"Automotive Technology offers a wide variety of opportunities for the students.  They can learn a valuable trade through a combination of classroom instruction and hands-on training.  Curriculum is revised to keep current with the latest technological developments in the automotive industry. \r\n\r\nSome key areas of instruction are:  Automotive maintenance and light repair, engine repair, automatic transmission/transaxle, manual drive train and axle, suspension and steering, brakes, electrical/electronic systems, heating and air conditioning, and engine performance.","Endpoint":"/Automotive"},{"Page Header":"Carpentry & Construction Management","Page Text":"The Carpentry program covers the major aspects of residential and light commercial construction as well as a variety of remodeling functions. Students will work with a variety of building and finishing materials in order to become familiar with proper methods. Training is given using hand tools, power tools, and other portable equipment. Onsite and offsite construction projects are incorporated into classroom instruction.","Page Video":" ","Endpoint":"/Carpentry"},{"Page Header":"Collision Repair Technology","Page Text":"This is a high tech area that is designed to provide training for persons interested to provide training for persons interested in learning how to repair damaged vehicles.  Students will learn how to repair damaged vehicles.  Students will learn how to repair wrecked vehicles using the latest techniques and equipment available.  This technical area features a Chief E-Z Liner frame machine, Dupont paint system, the latest spray guns available, and an Omni down draft spray booth with an oven.  Hands-on activities are mixed with the correct blend of theory to allow the students to master the techniques of frame repair, MIG Welding, painting and custom designs, dent removal, suspension systems, brakes, electrical systems, and state inspection.","Endpoint":"/Collision"},{"Page Header":"Commercial & Advertising Art","Page Text":"Students will prepare a portfolio throughout the program to promote their work and talent when they graduate.  The major emphasis is on the basic principles of design and elements of art through skill development and exploring different media.  Special emphasis is placed on manual as well as computer illustration, layout, composition, and photography skills.  Students will prepare graphic and advertising projects from the idea stage through to web/pre-press.  The students will be using industry software throughout this course learning the basic skills to advance.","Endpoint":"/Commerical"},{"Page Header":"Communications Technology","Page Text":"Communication Technology is a multimedia course preparing students for careers and post-secondary education in digital and print fields.  Explore audio and video media using state of the art studio equipment, cameras, lighting, and live production visual imaging software.  Create, print, and assemble publications, design and print t-shirts, and perform tasks related to desktop publishing.  Students will learn and apply industry relevant computer software applications to real world media projects in a wide variety of mediums.","Endpoint":"/Communications"},{"Page Header":"Criminal Justice","Page Text":"Do you have what it takes?  Personal responsibility, integrity, and self discipline are needed to be successful in the field of public safety.  Improve your physical training, take fingerprints, and perform first aid.  Make quick decisions while using the Fire Arms Training Simulator, and the Geospacial Information Systems mapping software. This program prepares students for entry level positions in the Criminal Justice arena, specifically, the field of Law Enforcement and Emergency Medical Services.  Personal responsibility, integrity, and self-discipline will be expected.  Intensive physical training, rigorous academics, and adherence to strict standards of personal appearance are required.","Endpoint":"/Criminal "},{"Page Header":"Dental Assisting","Page Text":"Work with patients in a dental office and work with the dental team. Learn to help the dentist chairside with procedures by passing dental instruments and materials to the dentist and keeping the mouth dry.   Mix and prepare dental materials, sterilize instruments, disinfect treatment rooms, take impressions and take x-rays.  Perform basic lab duties such as and make models of teeth. ","Endpoint":"/Dental"},{"Page Header":"Diesel Technology","Page Text":" Diesel Technology is a broad-based program covering basic diesel engine fundamentals, full truck alignment, electrical/electronic engines, precision measuring, engine overhaul, air brake systems, drive train components, and PA State inspection procedures.  This program also offers state of the art equipment which will be an asset in furthering your education. ","Endpoint":"/Diesel"},{"Page Header":"Early Childhood Education","Page Text":"Are you creative, energetic, and enjoy working with children?  Learn how to develop and present lesson plans to young children, spend time working at local elementary schools, at our on-site Early Learning Center, or at other community childcare programs.  Earn hours towards the 480 hours of training required to apply for your Child Development Associate Credential.","Endpoint":"/Childhood"},{"Page Header":"Electrical Occupations","Page Text":"\r\nSafely install electrical systems in residential and commercial industrial buildings.  Read and understand blueprints.  Wire a variety of receptacles and outlet boxes.  Mount electrical panels.  Study the theory of electricity and learn how to operate and repair electric motors and electro-mechanical controls.","Endpoint":"/Electrical"},{"Page Header":"Engineering/Advanced Manufacturing","Page Text":"This technical program prepares students to apply knowledge and skills in the engineering field.  Basic instruction is provided in a variety of areas associated with engineering such as civil engineering, electrical and electronic engineering, electromechanical instrumentation, industrial production and mechanical engineering.  Instruction includes but is not limited to electrical circuitry, electronic digital and microprocessor applications, high and low voltage applications, instrumentation calibration, prototype development, testing, inspecting, systems analysis and maintenance, applications to specific engineering systems, CAD/CAM, fluid power, heating and cooling, manufacturing systems, principles of mechanics, properties of materials, and report writing.","Endpoint":"/Engineering"},{"Page Header":"Heating, Ventilation & Air Conditioning/Plumbing","Page Text":"\r\nThe HVAC/Plumbing program trains students for the always changing, always in demand HVAC industry.  Students will learn to identify and safety use power and hand tools to complete hands-on projects.  They advanced to learning the materials and equipment of the field while completing more challenging installation jobs.  Students receive instruction on electricity and electrical components and controls, and the technical aspects of HVAC which includes proper installation, setup, service, and troubleshooting of residential and commercial heating and cooling systems.","Endpoint":"/HVAC"},{"Page Header":"Landscaping & Agriculture","Page Text":"The Landscaping & Agriculture Program covers training in equipment usage such as skid loader and Bobcat utility vehicle, greenhouse management, turf maintenance, plan identification, tree maintenance, nursery production and landscape design, management, and construction including pond and patio installation.  Practical experience is gained through school landscape plantings, plan and maintenance of a vegetable garden and maintenance of a nursery area.  Design is also taught using the Punch! Landscape Deck and Patio Designer program.","Endpoint":"/Landscaping"},{"Page Header":"Licensed Cosmetology","Page Text":"Students in the Licensed Cosmetology program study topics such as:  safety, history, careers, professionalism, infection control, chemistry, PA State Cosmetology law, salon business, and anatomy & physiology.  In addition, students are training in hair care skills such as shampooing, hair cutting, styling, braiding, perming, relaxing, coloring, foiling, extensions, and up-dos.  Instruction also includes the care of hands and nails, feet and toes, skin and makeup artistry.  Students practice these techniques on mannequins, practice hands, or people. \r\n\r\nDuring their junior and senior year, students participate in clinical experience by demonstrating services on customers at the cosmetology clinic-“Spartan Spa”. \r\n\r\nUpon completion of 1250 hours, a transcript of 75% of higher in the course, and an Official Criminal Record History check, students are able to take the State Board Examination, which is required for licensing.\r\n","Endpoint":"/Cosmetology"},{"Page Header":"Medical Professions Program","Page Text":"\r\nStudents are required to complete the foundation courses during the first two years at York Tech.  The intent of this program is to provide a foundation for these students and to aid students and teachers in choosing appropriate pathway placements that will lead to informed career decisions.\r\n\r\nThe Medical Professions Program includes several foundation courses to help students succeed in this high-paced, challenging career.  During the first two years, students will cover the following topics:\r\n\r\n    Orientation & Safety\r\n    Nutrition & Hydration\r\n    Medical Terminology/Human Body\r\n    Rehabilitation & Restoration\r\n    Diseases and Disorders\r\n    Basic Clinical Skills\r\n    Mathematics in Allied Health\r\n    Legal & Ethical Issues\r\n    Emergency Care & Disaster Preparedness","Endpoint":"/Medical"},{"Page Header":"PowerSports & Engine Technology","Page Text":"PowerSports and Engine Technology is designed to provide training for persons interested in repairing PowerSports equipment.  The areas that will be covered include:  motorcycles, marine products, lift trucks, lawn maintenance products, and the engines that power them.  ","Endpoint":"/Powersports"},{"Page Header":"Precision Machining Technology","Page Text":"This program builds a firm foundation in the following areas:  lathe, mill, grinder, drill press, bench work, precision measurement, print reading, and understanding geometric tolerances.  Students cover advanced machining techniques on Computer Numerical Control machines (CNC).","Endpoint":"/PrecisionMachining"},{"Page Header":"Sports Technology & Exercise Science","Page Text":"\r\nDo you enjoy physical activity and helping others?  Can you see yourself being a personal trainer, athletic trainer or physical therapist?  Learn the basic skills associated with athletic health care, basic anatomy and physiology.  Tape, wrap and brace athletic injuries.  Understand the proper ways to use heat and ice.  Chart vital signs such as blood pressure, pulse, temperature, and pain.","Endpoint":"/Sports"},{"Page Header":"Welding & Metal Fabrication Technology","Page Text":"\r\nWelding/Metal Fabrication Technology program is a very diverse area in which the students are trained on Shielded Metal Arc Welding, Flux Cored Arc Welding, Gas Tungsten Arc welding and Oxy-Acetylene/Cutting, Welding and Brazing processes. Students also study emerging technologies such as glass and plastic welding.  Theory includes the aspects relating to safety in today's welding facilities as well as welding symbol and blueprint usage.","Endpoint":"/Welding"}]